app/views/layouts/application.html.erb

SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 1], ["LIMIT", 1]]
---
        <div id="cart" class="carts">
          <%= render_if @cart && @cart.line_items.any?, @cart %>